In [61]:
import pandas as pd

In [62]:
# This dataset originally does not contain any null values
df=pd.read_csv('Datasets/DataScience_salaries_2024.csv')
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L
1,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
3,2021,MI,FT,ML Engineer,8500000,JPY,JP,50,JP,S,NaN
4,2022,SE,FT,Lead Machine Learning Engineer,7500000,INR,95386,IN,50,IN,L

In [63]:
# df.to_string()
df.shape

(14838, 11)

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14838 entries, 0 to 14837
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           14838 non-null  int64
 1   experience_level    14838 non-null  object
 2   employment_type     14838 non-null  object
 3   job_title           14838 non-null  object
 4   salary              14838 non-null  int64
 5   salary_currency     14838 non-null  object
 6   salary_in_usd       14838 non-null  object
 7   employee_residence  14838 non-null  object
 8   remote_ratio        14838 non-null  object
 9   company_location    14838 non-null  object
 10  company_size        14837 non-null  object
dtypes: int64(2), object(9)
memory usage: 1.2+ MB

In [66]:
# I will remove the salary_in_usd for 3 row which is nothing but a missing or nullvalue

# if null values exists dropna() will remove the entire row and give another dataframe without changing the orignial
df_new = df.dropna()
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14837 entries, 0 to 14837
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           14837 non-null  int64
 1   experience_level    14837 non-null  object
 2   employment_type     14837 non-null  object
 3   job_title           14837 non-null  object
 4   salary              14837 non-null  int64
 5   salary_currency     14837 non-null  object
 6   salary_in_usd       14837 non-null  object
 7   employee_residence  14837 non-null  object
 8   remote_ratio        14837 non-null  object
 9   company_location    14837 non-null  object
 10  company_size        14837 non-null  object
dtypes: int64(2), object(9)
memory usage: 1.4+ MB

In [67]:
# If we want to make changes in original dataframe use inplace attribute
df.dropna(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14837 entries, 0 to 14837
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           14837 non-null  int64
 1   experience_level    14837 non-null  object
 2   employment_type     14837 non-null  object
 3   job_title           14837 non-null  object
 4   salary              14837 non-null  int64
 5   salary_currency     14837 non-null  object
 6   salary_in_usd       14837 non-null  object
 7   employee_residence  14837 non-null  object
 8   remote_ratio        14837 non-null  object
 9   company_location    14837 non-null  object
 10  company_size        14837 non-null  object
dtypes: int64(2), object(9)
memory usage: 1.4+ MB

In [69]:
# But removing rows makes dataset vulnerable, instead removing rows filling the null data gives more rigidness
df=pd.read_csv('Datasets/DataScience_salaries_2024.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14838 entries, 0 to 14837
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           14838 non-null  int64
 1   experience_level    14838 non-null  object
 2   employment_type     14838 non-null  object
 3   job_title           14838 non-null  object
 4   salary              14838 non-null  int64
 5   salary_currency     14838 non-null  object
 6   salary_in_usd       14838 non-null  object
 7   employee_residence  14838 non-null  object
 8   remote_ratio        14838 non-null  object
 9   company_location    14838 non-null  object
 10  company_size        14837 non-null  object
dtypes: int64(2), object(9)
memory usage: 1.2+ MB

In [72]:
df['salary_in_usd'].fillna(10000,inplace=True)
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2021,MI,FT,Data Scientist,30400000,CLP,40038,CL,100,CL,L
1,2021,MI,FT,BI Data Analyst,11000000,HUF,36259,HU,50,US,L
2,2020,MI,FT,Data Scientist,11000000,HUF,35735,HU,50,HU,L
3,2021,MI,FT,ML Engineer,8500000,JPY,JP,50,JP,S,100
4,2022,SE,FT,Lead Machine Learning Engineer,7500000,INR,95386,IN,50,IN,L